Revit 2024 API
BuiltInFailures.AutoRouteFailures.FittingParamsCauseGeometryToFailError Property
 The one of parameters for the fitting is causing the geometry to fail.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FittingParamsCauseGeometryToFailError { get; }
Visual Basic
Public Shared ReadOnly Property FittingParamsCauseGeometryToFailError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FittingParamsCauseGeometryToFailError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace